var O = function() {},
    fn = O.prototype,
    JTStr = '一七万丈三上下不与丑专且世业东丝丢两严丧个中丰串临为主举久么义之乎乏乐乘九乞也习乡书买乱了予争事二于亏云云互五井亚些亡交亦产享京亮亲人亿什仁仅仇今介仍从仑仓仔他付代令以们件价任份仿企伊伍休众优伙伙会伟传伤伦伯估伴伸似但位低住体何余余余佛作你佩佳佶使例供依侥侧侵便促俊俗保信俩修俱倍倒候借值倾假偏做停健偶偷偿傍储催傻像僚僻儿元兄充兆先光克免党入全八公六兰共关兴兵其具典兹养兼冀内册再写军农冠冤冬冲冲决况冷净凄准凉减凑几凡凤凯凶凶出击函凿分切刊划列刘则刚创初删判利别到制券刺刻刽剂削前剎剥剧剩割力劝办功加务劣动助努劫励劲劳势勇勒募勤勾包匈化北匹区医匿十千升午半华协单卖南博占占卡卫印危即却卵厂历历厉压厌厕厘原厢厥去县参又叉及友双反发发叔取受变口古句另只叫召可台台史右叶号司吃各合吉同名后向向吓吕吗君吝吞否吧含听启吴吵吶吸吹吻吼吾呀告员呢周周味呵呼命咀和咖咧咽品哄哈哉响哑哗哥哪哭哲唉唯唱商啊啜啦善喊喔喜喧嗯嗲嘛嘲嘴嘶嘿噢器噩噪嚼四回因团园困围固国图圆圈土圣在地场址均坏坐块坚坛坦垄型垒埋城培基堂堆堕堪堵塑塔塞填境墓墙增墟士壮声壳壹处备复夕外多夜够大天太夫央失头夸夹夺奇奉奋奏契奔奖套奠奢女奴她好如妇妈妖妙妥妨妹始姑姓委姜姨姻威娃娄娘娱娶婆婚婴媒嫉嫌子孔字存孙孤学孩孽宁它宅守安完宕宗官定宜宝实宠审客宣宪宰害家家容寂寄密富寒察寡对寻导封射将尊小少尔尚尝尤尬就尴尺尽尾局屁层居屈届屋屎展属山岁岂岗岸崇州工左巧巨差己已巴巷币市布师希帝带席帮常幕干干平年并幸幸幻幼广庄庇床序库应底店府庞废度座庭庶康庸廊廖延建开异弃弄弊式引弟张弥弱弹强归当录形彩彪彭彰影役彻彼往征征径径待很律徒得微德徽心必忆忍志志忘忙忠快念忽忿怀态怆怎怒怕怜思急性怨怪总恋恍恐恒恢恨恩息恰恳恶悉悔悟您悬悯悲情惊惑惕惜惨惯想愈意愚感愤愿慈慢慰憾懂懒戍戏成我或战戚截戴户房所扁扈手才扑打扔托扛扣执扩扫扬扭扮扯扰批扼找承技抄抉把抑抒抓投抗折折抚抢护报披抬抱抵押抽担拆拉拍拒拓拖拘拚招拜拟拢拥拨择括拼拿持挂指按挑挖挤挥挨挫振挺挽捅捉捐捕捞损换据掀掉掌掏掐排掘探接控推描提插握揣揪揭援搁搜搞摄摆摇摊摘摧摩撇撑撤撬播擅攒攫支收改攻放政故效敌敏救教敛敢散敬数整文斗料斥断斯新方施旁旅旋族旗无既日旦旧早时昌明昏易星春昧昨是显晓晚普景晰晴智暂暇暑暖暗暴曲更曾替最月有朋服朔望朝期木未末本术机杀杂权材村束条来杨杯杰板板极构枉析林果枯架某染查标栈栏树校样核根格框案桌档桦桶梦梨梯检棒棚椅楚楼概榜榨槛樟模横欠次欢欧欲款歌止正此步武歧死殊残段殷毁母每毒比毕毛毫民气水永求汇汉江污汰沉沙沟没沦河油治沾沿泄法泛泡波泣泥注泪泯泰泽洋洗洛津洪洲活派流浅测济浏浑浓浩浪浮海浸消涉涌涛涡涤润涨液涵淘淡深混添清渐渗渡渣渥温港游游湖湾湿源滋滑滚滞满滴漂漏演漩漫潘潜潮澡激灌火灭灯灰灵灾灿炒炫炸点烂烈烦烧热焉焦然煤照煽熊熏熟燃燥爆爱父爷爸爽片版牌牙牛牢物牲牵特牺犯状犹狂狄狗独狭狱狼猖猛猜獗率玉王玩环现珊班球理琴瑞瑟璋瓦瓶甚生用甫田由甲申电男画畅界留略番畴疆疑疗疮疲病痒痛登白百皂的皆皇皮益监盒盖盘盟目盯盲直相盼盾省看真眷眼著睛睡瞧瞭矛矣知短石矿码研破砸础硬确碍碗碣碧碰磁磨示社祖神票禁福离禽秀私种科秒秩积称移稀程稍税稚稳稻究穷空穿突窗立站竞竟章童端竹竿笑笔符笨第等筑答策筝筹签签简算管篇籍类粉粒粗粮粹精糊糕糟糟系素索紧紫累繁纠红约级纪纯纲纳纷纸纽纾线练组绅细织终绍经结给络绝统继绩绪续绳维绵综绿缓缔编缚缝缩缴缺网罗罢罪置署羊美羞群翔翱翻翼耀耀老考者而耐耗耳耶耸耻聋职联聚肉肌肚肝股肤肩肪肯育肾胁胃胆背胚胜胞胡胳能脂脆脉脏脏脑脚脱脸腐腥腾臂自臭至致舆舍舍舒舞舟航般舰舱船良艰色艺节芦芬花苏苟若苦英范茅茍草荐荒荡荣药荼莎莫莱莲获获菜营萧落葬蒙蓄蓍蓝蔑蔓薄薪藉藏虑虚虫虽蚀蚁蚂蚊蛋蛙蛛蜂蝴蝶融蠢血行衍衡衣补表袋袖被袭裁裂装裸西要覆见观规视览觉角解触言誉警譬计订认讨让议讯记讲讳讶许论讽设访证评识诉词译试诗诚话询该详语误说请诸读课谁调谅谈谋谎谓谢谣谩谬象貌贝负财责败货质贩贪贫购贯贴贵费资赌赏赖赘赚赛赞赞赢赤赫走赴赶起超越趋趟趣足跃跋跑距跟跨路跳践踏踩踮蹲身躲车轨转轮软轰轻载较辄辆辈辉辐辑输辛辜辞辣辨辩辱边达迁迅过迈迎运近返还这进远违连迫述迷迹迹追退送适逃逆选透逐递途通逛速造逢逮逸逻遇遍遑道遗遥遭遮遵避邓那邮邻郑部郭都酋配酒酷酸酿醒采释里重野量金针钙钟钢钦钮钱钻铁铅铜铲链销锁锄错锦键锺镖镜长门闪闭问闲间闷闹闻阂阅阙队防阳阴阵阶阻阿附际陆陈陋降限院除险陪陶陷随隐隔隘障隶难雄集雇雇雏雨雳零雷需霄露霹青静非靠面革鞋鞭韩音页顶顷项顺须顾顿颂预领颇频颖题额风飞食餐饥饭饰饱饼饿馆首香马驭驱驳驼驾骂骆验骑骗骤骨髓高鬼魂魏鱼鲁鲜鸣鸭鸯鸳鹰鹿麻黄黑鼎鼓鼠齐齿龙樱剑皑蔼袄奥坝颁绊绑镑谤鲍钡狈惫绷毙贬辫鳖瘪濒滨宾摈钵铂卜蚕惭苍沧诧搀掺蝉馋谗缠阐颤肠钞尘衬惩骋痴迟驰炽踌绸橱厨闯锤绰赐聪葱囱丛窜贷郸掸惮诞挡捣岛祷盗垫淀钓迭谍叠钉锭栋冻犊镀锻缎兑吨钝鹅讹饵贰罚阀珐矾钒纺坟粪枫锋疯冯辅赋讣秆赣冈皋镐鸽阁铬龚宫巩贡钩蛊剐硅龟闺诡柜辊锅骇鹤贺鸿壶沪唤痪焕涣贿秽烩诲绘荤祸讥鸡缉蓟荚颊贾钾歼笺缄茧碱硷拣捡俭鉴贱饯溅涧浆蒋桨酱胶浇骄娇搅铰矫饺绞轿秸茎颈痉厩驹锯惧鹃绢洁诫谨晋烬荆诀钧骏颗垦抠裤侩宽旷岿窥馈溃阔蜡腊拦篮阑澜谰揽缆滥涝镭篱鲤礼丽砾沥镰涟帘炼辽镣猎鳞凛赁龄铃凌岭馏咙笼陇搂篓卢颅庐炉掳卤虏赂禄驴铝侣屡缕滤峦挛孪滦抡纶萝锣箩骡玛麦瞒馒蛮猫锚铆贸霉镁锰谜觅缅庙闽铭亩钠挠恼馁腻撵捻鸟聂啮镊镍柠狞拧泞脓疟诺鸥殴呕沤赔喷鹏飘苹凭泼铺朴谱脐讫扦钎谦钳谴堑枪呛蔷锹桥乔侨翘窍窃氢庆琼躯龋颧鹊饶绕韧纫绒锐闰洒萨鳃伞骚涩纱筛晒陕赡缮赊慑婶狮尸驶寿兽枢赎竖帅硕烁饲怂讼诵擞肃绥笋琐獭挞瘫滩谭叹汤烫绦誊锑屉厅烃涂颓蜕鸵驮椭洼袜弯顽韦潍苇伪纬纹瓮挝蜗窝呜钨乌诬芜坞雾锡铣虾辖峡侠厦锨纤咸贤衔献馅羡镶啸蝎挟携谐泻锌衅汹锈绣嘘轩癣绚勋驯训逊鸦阉烟盐颜阎艳砚彦谚疡瑶尧窑铱颐仪彝诣谊绎荫银饮缨莹萤荧蝇哟佣痈踊咏忧铀诱渔屿吁御渊辕缘钥岳粤悦郧匀陨蕴酝晕韵赃枣灶贼赠扎札轧铡闸诈斋债毡盏斩辗崭绽帐账胀赵蛰辙锗贞侦诊镇挣睁狰帧挚掷帜肿诌轴皱昼猪诛烛瞩嘱贮铸驻砖桩妆锥坠缀谆浊渍踪纵邹诅',
    FTStr = '一七萬丈三上下不與醜專且世業東絲丟兩嚴喪個中豐串臨為主舉久麼義之乎乏樂乘九乞也習鄉書買亂了予爭事二於虧雲云互五井亞些亡交亦產享京亮親人億什仁僅仇今介仍從崙倉仔他付代令以們件價任份仿企伊伍休眾優伙夥會偉傳傷倫伯估伴伸似但位低住體何余餘馀佛作你佩佳佶使例供依僥側侵便促俊俗保信倆修俱倍倒候借值傾假偏做停健偶偷償傍儲催傻像僚僻兒元兄充兆先光克免黨入全八公六蘭共關興兵其具典茲養兼冀內冊再寫軍農冠冤冬衝沖決況冷淨淒準涼減湊幾凡鳳凱兇凶出擊函鑿分切刊劃列劉則剛創初刪判利別到制券刺刻劊劑削前剎剝劇剩割力勸辦功加務劣動助努劫勵勁勞勢勇勒募勤勾包匈化北匹區醫匿十千升午半華協單賣南博占佔卡衛印危即卻卵廠歷曆厲壓厭廁釐原廂厥去縣參又叉及友雙反發髮叔取受變口古句另只叫召可台臺史右葉號司吃各合吉同名後向嚮嚇呂嗎君吝吞否吧含聽啟吳吵吶吸吹吻吼吾呀告員呢周週味呵呼命咀和咖咧咽品哄哈哉響啞譁哥哪哭哲唉唯唱商啊啜啦善喊喔喜喧嗯嗲嘛嘲嘴嘶嘿噢器噩噪嚼四回因團園困圍固國圖圓圈土聖在地場址均壞坐塊堅壇坦壟型壘埋城培基堂堆墮堪堵塑塔塞填境墓牆增墟士壯聲殼壹處備複夕外多夜夠大天太夫央失頭誇夾奪奇奉奮奏契奔獎套奠奢女奴她好如婦媽妖妙妥妨妹始姑姓委薑姨姻威娃婁娘娛娶婆婚嬰媒嫉嫌子孔字存孫孤學孩孽寧它宅守安完宕宗官定宜寶實寵審客宣憲宰害家傢容寂寄密富寒察寡對尋導封射將尊小少爾尚嘗尤尬就尷尺盡尾局屁層居屈屆屋屎展屬山歲豈崗岸崇州工左巧鉅差己已巴巷幣市布師希帝帶席幫常幕幹乾平年並幸倖幻幼廣莊庇床序庫應底店府龐廢度座庭庶康庸廊廖延建開異棄弄弊式引弟張彌弱彈強歸當錄形彩彪彭彰影役徹彼往征徵徑逕待很律徒得微德徽心必憶忍志誌忘忙忠快念忽忿懷態愴怎怒怕憐思急性怨怪總戀恍恐恆恢恨恩息恰懇惡悉悔悟您懸憫悲情驚惑惕惜慘慣想愈意愚感憤願慈慢慰憾懂懶戍戲成我或戰戚截戴戶房所扁扈手才撲打扔託扛扣執擴掃揚扭扮扯擾批扼找承技抄抉把抑抒抓投抗摺折撫搶護報披抬抱抵押抽擔拆拉拍拒拓拖拘拚招拜擬攏擁撥擇括拼拿持掛指按挑挖擠揮挨挫振挺挽捅捉捐捕撈損換據掀掉掌掏掐排掘探接控推描提插握揣揪揭援擱搜搞攝擺搖攤摘摧摩撇撐撤撬播擅攢攫支收改攻放政故效敵敏救教斂敢散敬數整文鬥料斥斷斯新方施旁旅旋族旗無既日旦舊早時昌明昏易星春昧昨是顯曉晚普景晰晴智暫暇暑暖暗暴曲更曾替最月有朋服朔望朝期木未末本術機殺雜權材村束條來楊杯傑闆板極構枉析林果枯架某染查標棧欄樹校樣核根格框案桌檔樺桶夢梨梯檢棒棚椅楚樓概榜榨檻樟模橫欠次歡歐慾款歌止正此步武歧死殊殘段殷毀母每毒比畢毛毫民氣水永求彙漢江污汰沉沙溝沒淪河油治沾沿洩法泛泡波泣泥注淚泯泰澤洋洗洛津洪洲活派流淺測濟瀏渾濃浩浪浮海浸消涉湧濤渦滌潤漲液涵淘淡深混添清漸滲渡渣渥溫港遊游湖灣濕源滋滑滾滯滿滴漂漏演漩漫潘潛潮澡激灌火滅燈灰靈災燦炒炫炸點爛烈煩燒熱焉焦然煤照煽熊薰熟燃燥爆愛父爺爸爽片版牌牙牛牢物牲牽特犧犯狀猶狂狄狗獨狹獄狼猖猛猜獗率玉王玩環現珊班球理琴瑞瑟璋瓦瓶甚生用甫田由甲申電男畫暢界留略番疇疆疑療瘡疲病癢痛登白百皂的皆皇皮益監盒蓋盤盟目盯盲直相盼盾省看真眷眼著睛睡瞧瞭矛矣知短石礦碼研破砸礎硬確礙碗碣碧碰磁磨示社祖神票禁福離禽秀私種科秒秩積稱移稀程稍稅稚穩稻究窮空穿突窗立站競竟章童端竹竿笑筆符笨第等築答策箏籌簽籤簡算管篇籍類粉粒粗糧粹精糊糕蹧糟係素索緊紫累繁糾紅約級紀純綱納紛紙紐紓線練組紳細織終紹經結給絡絕統繼績緒續繩維綿綜綠緩締編縛縫縮繳缺網羅罷罪置署羊美羞群翔翱翻翼燿耀老考者而耐耗耳耶聳恥聾職聯聚肉肌肚肝股膚肩肪肯育腎脅胃膽背胚勝胞胡骼能脂脆脈臟髒腦腳脫臉腐腥騰臂自臭至致輿捨舍舒舞舟航般艦艙船良艱色藝節蘆芬花甦苟若苦英範茅茍草薦荒盪榮藥荼莎莫萊蓮穫獲菜營蕭落葬蒙蓄蓍藍蔑蔓薄薪藉藏慮虛蟲雖蝕蟻螞蚊蛋蛙蛛蜂蝴蝶融蠢血行衍衡衣補表袋袖被襲裁裂裝裸西要覆見觀規視覽覺角解觸言譽警譬計訂認討讓議訊記講諱訝許論諷設訪證評識訴詞譯試詩誠話詢該詳語誤說請諸讀課誰調諒談謀謊謂謝謠謾謬象貌貝負財責敗貨質販貪貧購貫貼貴費資賭賞賴贅賺賽贊讚贏赤赫走赴趕起超越趨趟趣足躍跋跑距跟跨路跳踐踏踩踮蹲身躲車軌轉輪軟轟輕載較輒輛輩輝輻輯輸辛辜辭辣辨辯辱邊達遷迅過邁迎運近返還這進遠違連迫述迷蹟跡追退送適逃逆選透逐遞途通逛速造逢逮逸邏遇遍遑道遺遙遭遮遵避鄧那郵鄰鄭部郭都酋配酒酷酸釀醒採釋裡重野量金針鈣鐘鋼欽鈕錢鑽鐵鉛銅鏟鏈銷鎖鋤錯錦鍵鍾鏢鏡長門閃閉問閒間悶鬧聞閡閱闕隊防陽陰陣階阻阿附際陸陳陋降限院除險陪陶陷隨隱隔隘障隸難雄集雇僱雛雨靂零雷需霄露霹青靜非靠面革鞋鞭韓音頁頂頃項順須顧頓頌預領頗頻穎題額風飛食餐饑飯飾飽餅餓館首香馬馭驅駁駝駕罵駱驗騎騙驟骨髓高鬼魂魏魚魯鮮鳴鴨鴦鴛鷹鹿麻黃黑鼎鼓鼠齊齒龍櫻劍皚藹襖奧壩頒絆綁鎊謗鮑鋇狽憊繃斃貶辮鼈癟瀕濱賓擯缽鉑卜蠶慚蒼滄詫攙摻蟬饞讒纏闡顫腸鈔塵襯懲騁癡遲馳熾躊綢櫥廚闖錘綽賜聰蔥囪叢竄貸鄲撣憚誕擋搗島禱盜墊澱釣叠諜疊釘錠棟凍犢鍍鍛緞兌噸鈍鵝訛餌貳罰閥琺礬釩紡墳糞楓鋒瘋馮輔賦訃稈贛岡臯鎬鴿閣鉻龔宮鞏貢鈎蠱剮矽龜閨詭櫃輥鍋駭鶴賀鴻壺滬喚瘓煥渙賄穢燴誨繪葷禍譏雞緝薊莢頰賈鉀殲箋緘繭堿鹼揀撿儉鑒賤餞濺澗漿蔣槳醬膠澆驕嬌攪鉸矯餃絞轎稭莖頸痙廄駒鋸懼鵑絹潔誡謹晉燼荊訣鈞駿顆墾摳褲儈寬曠巋窺饋潰闊蠟臘攔籃闌瀾讕攬纜濫澇鐳籬鯉禮麗礫瀝鐮漣簾煉遼鐐獵鱗凜賃齡鈴淩嶺餾嚨籠隴摟簍盧顱廬爐擄鹵虜賂祿驢鋁侶屢縷濾巒攣孿灤掄綸蘿鑼籮騾瑪麥瞞饅蠻貓錨鉚貿黴鎂錳謎覓緬廟閩銘畝鈉撓惱餒膩攆撚鳥聶齧鑷鎳檸獰擰濘膿瘧諾鷗毆嘔漚賠噴鵬飄蘋憑潑鋪樸譜臍訖扡釺謙鉗譴塹槍嗆薔鍬橋喬僑翹竅竊氫慶瓊軀齲顴鵲饒繞韌紉絨銳閏灑薩鰓傘騷澀紗篩曬陝贍繕賒懾嬸獅屍駛壽獸樞贖豎帥碩爍飼慫訟誦擻肅綏筍瑣獺撻癱灘譚歎湯燙縧謄銻屜廳烴塗頹蛻鴕馱橢窪襪彎頑韋濰葦僞緯紋甕撾蝸窩嗚鎢烏誣蕪塢霧錫銑蝦轄峽俠廈鍁纖鹹賢銜獻餡羨鑲嘯蠍挾攜諧瀉鋅釁洶鏽繡噓軒癬絢勳馴訓遜鴉閹煙鹽顔閻豔硯彥諺瘍瑤堯窯銥頤儀彜詣誼繹蔭銀飲纓瑩螢熒蠅喲傭癰踴詠憂鈾誘漁嶼籲禦淵轅緣鑰嶽粵悅鄖勻隕蘊醞暈韻贓棗竈賊贈紮劄軋鍘閘詐齋債氈盞斬輾嶄綻帳賬脹趙蟄轍鍺貞偵診鎮掙睜猙幀摯擲幟腫謅軸皺晝豬誅燭矚囑貯鑄駐磚樁妝錐墜綴諄濁漬蹤縱鄒詛';
var toSimplified = function(s) {
    var str = '',
        len = 'string' == typeof s ? s.length : 0,
        i;
    for (i = 0; i < len; i++) {
        str += ( s.charCodeAt(i) > 10000 && FTStr.indexOf(s.charAt(i) ) != -1) ? ( JTStr.charAt(FTStr.indexOf(s.charAt(i))) ) : ( s.charAt(i) );
    }
    return str;
};

var toTraditional = function(s) {
    var str = '',
        len = 'string' == typeof s ? s.length : 0,
        i;
    for (i = 0; i < len; i++) {
        str += ( s.charCodeAt(i) > 10000 && JTStr.indexOf(s.charAt(i)) != -1 ) ? (FTStr.charAt(JTStr.indexOf(s.charAt(i)))) : (s.charAt(i));
    }
    return str;
};

var convert = function(txt, flag) {
    if (txt == "" || txt == null) {
        return "";
    }
    if(flag) {
        return toTraditional(txt);
    }
    return toSimplified(txt);
};

/**
 *
 * @param dom 要转换内容的dom对象
 * @param flag    true转换成繁体 false 简体
 */
fn.convertText = function(dom, flag) {
    if(typeof flag == 'undefined') {
        flag = true;
    }
    dom = !dom ? document.body.childNodes : dom.childNodes;
    for(var i = 0; i < dom.length; i++) {
        var item = dom.item(i);
        if("||BR|HR|TEXTAREA|".indexOf("|" + item.tagName + "|") > 0) {
            continue;
        }
        if(item.title != "" && item.title != null) {
            item.title = convert(item.title, flag);
        }
        if(item.alt != "" && item.alt != null) {
            item.alt = convert(item.alt, flag);
        }
        if(item.placeholder != "" && item.placeholder != null) {
            item.placeholder = convert(item.placeholder, flag);
        }
        if (item.tagName == "INPUT" && item.value != "" && item.type != "text" && item.type != "hidden" && item.type != "file") {
            item.value = convert(item.value, flag);
        }
        if(3 == item.nodeType) {
            if('' != item.data) {
                item.data = convert(item.data, flag);
            }
        }else {
            this.convertText(item, flag);
        }
    }
};

module.exports = {
    jf: new O
};